In [6]:
%matplotlib inline
import numpy as np 
import  pandas as pd
df = pd.read_csv("PastHires.csv")
df.head()

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,Y,4,BS,N,N,Y
1,0,N,0,BS,Y,Y,Y
2,7,N,6,BS,N,N,N
3,2,Y,1,MS,Y,N,Y
4,20,N,2,PhD,Y,N,N

In [7]:
df.head()

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,Y,4,BS,N,N,Y
1,0,N,0,BS,Y,Y,Y
2,7,N,6,BS,N,N,N
3,2,Y,1,MS,Y,N,Y
4,20,N,2,PhD,Y,N,N

In [8]:
df.tail()

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
8,15,Y,5,BS,N,N,Y
9,0,N,0,BS,N,N,N
10,1,N,1,PhD,Y,N,N
11,4,Y,1,BS,N,Y,Y
12,0,N,0,PhD,Y,N,Y

In [11]:
df.shape

(13, 7)

In [13]:
df.size

91

In [14]:
len(df)

13

In [15]:
df.columns

Index(['Years Experience', 'Employed?', 'Previous employers',
       'Level of Education', 'Top-tier school', 'Interned', 'Hired'],
      dtype='object')

In [16]:
df["Hired"]

0     Y
1     Y
2     N
3     Y
4     N
5     Y
6     Y
7     Y
8     Y
9     N
10    N
11    Y
12    Y
Name: Hired, dtype: object

In [17]:
df["Hired"][:5]

0    Y
1    Y
2    N
3    Y
4    N
Name: Hired, dtype: object

In [18]:
df["Hired"][5]

'Y'

In [23]:
df.sort_values(['Years Experience'])

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
1,0,N,0,BS,Y,Y,Y
5,0,N,0,PhD,Y,Y,Y
9,0,N,0,BS,N,N,N
12,0,N,0,PhD,Y,N,Y
10,1,N,1,PhD,Y,N,N
3,2,Y,1,MS,Y,N,Y
7,3,N,1,BS,N,Y,Y
11,4,Y,1,BS,N,Y,Y
6,5,Y,2,MS,N,Y,Y
2,7,N,6,BS,N,N,N
0,10,Y,4,BS,N,N,Y
8,15,Y,5,BS,N,N,Y
4,20,N,2,PhD,Y,N,N

In [24]:
degree_counts = df["Level of Education"].value_counts()

In [25]:
degree_counts

BS     7
PhD    4
MS     2
Name: Level of Education, dtype: int64

In [ ]:
degree_counts.plot(kind='bar')